#pragma once
#include "Basic.h"
#include "Utils/utils.h"
namespace UE {
	template<typename ArrayElementType>
	class TArray;
	class FString;
	class FText;
	class UObject;
	class UClass;
	class UFunction;

	class UEngine;
	class UWorld;
	class UCanvas;
	class AHUD;
	class UBaseUIController;
	class UBatchUIController;
	class UGameViewportClient;
	class APlayerState;

	class AActor;
	class AGPWeaponBase;
	class AWeaponBase;

	class UVisual;
	class UWidget;
	class UUserWidget;
	class UBaseUIView;
	class UMapBaseHUDView;
	class UMiniMapHUDView;
	class UMiniMapHUDViewSafeHouse;
	class UWBP_MiniMap_Mobile_C;
	class UBigMapHUDView;
	class USOLBigMapHUDView_Main;
	class UWBP_Map_Main_PC_C;

	//基础结构类开始
	namespace Iterators
	{
		template<typename ArrayType>
		class TArrayIterator
		{
		private:
			TArray<ArrayType>& IteratedArray;
			int32 Index;

		public:
			TArrayIterator(const TArray<ArrayType>& Array, int32 StartIndex = 0x0)
				: IteratedArray(const_cast<TArray<ArrayType>&>(Array)), Index(StartIndex)
			{
			}

		public:
			inline int32 GetIndex() { return Index; }

			inline int32 IsValid() { return IteratedArray.IsValidIndex(GetIndex()); }

		public:
			inline TArrayIterator& operator++() { ++Index; return *this; }
			inline TArrayIterator& operator--() { --Index; return *this; }

			inline       ArrayType& operator*() { return IteratedArray[GetIndex()]; }
			inline const ArrayType& operator*() const { return IteratedArray[GetIndex()]; }

			inline       ArrayType* operator->() { return &IteratedArray[GetIndex()]; }
			inline const ArrayType* operator->() const { return &IteratedArray[GetIndex()]; }

			inline bool operator==(const TArrayIterator& Other) const { return &IteratedArray == &Other.IteratedArray && Index == Other.Index; }
			inline bool operator!=(const TArrayIterator& Other) const { return &IteratedArray != &Other.IteratedArray || Index != Other.Index; }
		};
	}
	template<typename T> inline Iterators::TArrayIterator<T> begin(const TArray<T>& Array) { return Iterators::TArrayIterator<T>(Array, 0); }
	template<typename T> inline Iterators::TArrayIterator<T> end(const TArray<T>& Array) { return Iterators::TArrayIterator<T>(Array, Array.Num()); }

	template<typename ArrayElementType>
	class TArray
	{
	private:
		template<typename ArrayElementType>
		friend class TAllocatedArray;

		template<typename SparseArrayElementType>
		friend class TSparseArray;

	protected:
		static constexpr uint64 ElementAlign = alignof(ArrayElementType);
		static constexpr uint64 ElementSize = sizeof(ArrayElementType);

	public:
		ArrayElementType* Data;
		int32 NumElements;
		int32 MaxElements;

	public:
		TArray()
			: Data(nullptr), NumElements(0), MaxElements(0)
		{
		}

		TArray(const TArray&) = default;

		TArray(TArray&&) = default;

	public:
		TArray& operator=(TArray&&) = default;
		TArray& operator=(const TArray&) = default;

	private:
		inline int32 GetSlack() const { return MaxElements - NumElements; }

		inline void VerifyIndex(int32 Index) const { if (!IsValidIndex(Index)) throw std::out_of_range("Index was out of range!"); }

		inline       ArrayElementType& GetUnsafe(int32 Index) { return Data[Index]; }
		inline const ArrayElementType& GetUnsafe(int32 Index) const { return Data[Index]; }

	public:
		/* Adds to the array if there is still space for one more element */
		inline bool Add(const ArrayElementType& Element)
		{
			if (GetSlack() <= 0)
				return false;

			Data[NumElements] = Element;
			NumElements++;

			return true;
		}

		inline bool Remove(int32 Index)
		{
			if (!IsValidIndex(Index))
				return false;

			NumElements--;

			for (int i = Index; i < NumElements; i++)
			{
				/* NumElements was decremented, acessing i + 1 is safe */
				Data[i] = Data[i + 1];
			}

			return true;
		}

		inline void Clear()
		{
			NumElements = 0;

			if (!Data)
				memset(Data, 0, NumElements * ElementSize);
		}

	public:
		inline int32 Num() const { return NumElements; }
		inline int32 Max() const { return MaxElements; }

		inline const ArrayElementType* GetDataPtr() const { return Data; }

		inline bool IsValidIndex(int32 Index) const { return Data && Index >= 0 && Index < NumElements; }

		inline bool IsValid() const { return Data && NumElements > 0 && MaxElements >= NumElements; }

	public:
		inline       ArrayElementType& operator[](int32 Index) { VerifyIndex(Index); return Data[Index]; }
		inline const ArrayElementType& operator[](int32 Index) const { VerifyIndex(Index); return Data[Index]; }

		inline bool operator==(const TArray<ArrayElementType>& Other) const { return Data == Other.Data; }
		inline bool operator!=(const TArray<ArrayElementType>& Other) const { return Data != Other.Data; }

		inline explicit operator bool() const { return IsValid(); };

	public:
		template<typename T> friend Iterators::TArrayIterator<T> begin(const TArray& Array);
		template<typename T> friend Iterators::TArrayIterator<T> end(const TArray& Array);
	};
	class FString : public TArray<wchar_t>
	{
	public:
		friend std::ostream& operator<<(std::ostream& Stream, const FString& Str) { return Stream << Str.ToString(); }

	public:
		using TArray::TArray;

		FString(const wchar_t* Str)
		{
			const uint32 NullTerminatedLength = static_cast<uint32>(wcslen(Str) + 0x1);

			Data = const_cast<wchar_t*>(Str);
			NumElements = NullTerminatedLength;
			MaxElements = NullTerminatedLength;
		}

		FString(wchar_t* Str, int32 Num, int32 Max)
		{
			Data = Str;
			NumElements = Num;
			MaxElements = Max;
		}

	public:
		inline std::string ToString() const;

		inline std::wstring ToWString() const
		{
			if (*this)
				return std::wstring(Data);

			return L"";
		}

	public:
		inline       wchar_t* CStr() { return Data; }
		inline const wchar_t* CStr() const { return Data; }

	public:
		inline bool operator==(const FString& Other) const { return Other ? NumElements == Other.NumElements && wcscmp(Data, Other.Data) == 0 : false; }
		inline bool operator!=(const FString& Other) const { return Other ? NumElements != Other.NumElements || wcscmp(Data, Other.Data) != 0 : true; }
	};
	class FFreableString : public FString
	{
	public:
		using FString::FString;

		FFreableString(uint32_t NumElementsToReserve)
		{
			if (NumElementsToReserve > 0x1000000)
				return;

			this->Data = static_cast<wchar_t*>(malloc(sizeof(wchar_t) * NumElementsToReserve));
			this->NumElements = 0;
			this->MaxElements = NumElementsToReserve;
		}

		~FFreableString()
		{
			/* If we're using FName::ToString the allocation comes from the engine and we can not free it. Just leak those 2048 bytes. */
			//if (Off::InSDK::Name::bIsUsingAppendStringOverToString)
			FreeArray();
		}

	public:
		inline void ResetNum()
		{
			this->NumElements = 0;
		}

	private:
		inline void FreeArray()
		{
			this->NumElements = 0;
			this->MaxElements = 0;
			if (this->Data) free(this->Data);
			this->Data = nullptr;
		}
	};
	namespace FTextImpl
	{
		class FTextData final
		{
		public:
			FString TextSource;
		public:
			FString get_TextSource() {
				return  memory_helpers::ReadField<FString>(this, Off::Text::InTextDataStringOffset);
			}
		};
	}
	class FText final {
	public:
		FTextImpl::FTextData* TextData;
		uint8   Pad_8[0x10];
	public:
		FTextImpl::FTextData* get_TextData() {
			return  memory_helpers::ReadField<FTextImpl::FTextData*>(this, Off::Text::TextDatOffset);
		}
	};
	class FName {
	private:
		static inline void (*fnAppendString)(const FName*, FString&) = nullptr;
	public:
		int32 ComparisonIndex;
		int32 Number;
	public:
		static void AppendString(const FName* InName, FString* OutFstring);
	private:
		static void InitInternal() {
			fnAppendString = reinterpret_cast<decltype(fnAppendString)>((DWORD_PTR)GetModuleHandleA(nullptr) + Off::Name::AppendNameToString);
		}
		std::wstring ToRawWString() {
			FFreableString TempString(1024);
			AppendString(this, &TempString);
			std::wstring OutputString = TempString.ToWString();
			return OutputString;
		}
	public:
		std::wstring c_wstr() {
			return ToRawWString();
		}
		std::string c_str() {
			return us2_to_gbk(ToRawWString());
		}
	};
	class UObject {
	private:
		static inline UObject* (*fnStaticFindObject)(UClass*, UObject*, const wchar_t*, bool) = nullptr;
		static inline void (*fnFree)(void*) = nullptr;
		static void InitInternal() {
			fnStaticFindObject = reinterpret_cast<decltype(fnStaticFindObject)>((DWORD_PTR)GetModuleHandleA(nullptr) + Off::UObject::StaticFindObject);
			fnFree = reinterpret_cast<decltype(fnFree)>((DWORD_PTR)GetModuleHandleA(nullptr) + Off::UObject::UEFree);

		}
	public:
		static void Free(void* ptr);
		static UObject* StaticFindObject(UClass* Clss, UObject* Outer, const wchar_t* Nane, bool ExactClass = false);
	public:
		template<class T = UClass>
		static inline T* FindObject(UObject* Outer, const wchar_t* Name, bool ExactClass = false)
		{
			return StaticFindObject(T::StaticClass(), Outer, Name, ExactClass)->Cast<T>();
		}
		template<typename UEType = UObject>
		static inline UEType* FindObject(const wchar_t* Name, int offset = 0)
		{
			return StaticFindObject(nullptr, reinterpret_cast<UObject*>(-1), Name + offset, false)->Cast<UEType>();
		}


	public:
		std::wstring GetName() {
			return get_Name().c_wstr();
		}
	public:
		template<typename To>
		To* Cast() { return static_cast<To*>(this); }
		void* GetVTableFunc(int index) {
			void* vtf = memory_helpers::ReadField<void*>(this, 0);
			if (vtf) {
				void* func = memory_helpers::ReadField<void*>(vtf, index * sizeof(void*));
				if (func) {
					return func;
				}
			}
			return nullptr;
		}
	public:
		UClass* get_Class() {
			return memory_helpers::ReadField<UClass*>(this, Off::UObject::Class);
		}
		UObject* get_Outer() {
			return memory_helpers::ReadField<UObject*>(this, Off::UObject::Outer);
		}
		EObjectFlags get_Flags() {
			return memory_helpers::ReadField<EObjectFlags>(this, Off::UObject::Flags);
		}
		FName get_Name() {
			return memory_helpers::ReadField<FName>(this, Off::UObject::Name);
		}
		int32 get_Index() {
			return memory_helpers::ReadField<int32>(this, Off::UObject::Index);
		}
	public:
		bool HasTypeFlag(EClassCastFlags TypeFlags);
		bool IsA(EClassCastFlags TypeFlags);
		bool IsA(UClass* TypeClass);
	public:
		void ProcessEvent(UFunction* Func, void* Params);

	};
	class FField
	{
	public:
		FField* get_Next() {
			return memory_helpers::ReadField <FField*>(this, Off::FField::Next);
		}
		UClass* get_Class() {
			return memory_helpers::ReadField <UClass*>(this, Off::FField::Class);
		}
		FName get_Name() {
			return memory_helpers::ReadField <FName>(this, Off::FField::Name);
		}
		int32 get_ObjFlags() {
			return memory_helpers::ReadField <int32>(this, Off::FField::Flags);
		}
	};
	class FProperty : public FField
	{
	public:
		int32 get_ArrayDim() {
			return memory_helpers::ReadField <int32>(this, Off::Property::ArrayDim);
		}
		int32 get_ElementSize() {
			return memory_helpers::ReadField <int32>(this, Off::Property::ElementSize);
		}
		uint64 get_PropertyFlags() {
			return memory_helpers::ReadField <int32>(this, Off::Property::PropertyFlags);
		}
		int32 get_Offset() {
			return memory_helpers::ReadField <int32>(this, Off::Property::Offset_Internal);
		}
	};
	class UField : public UObject {
	public:
		UField* get_Next() {
			return memory_helpers::ReadField<UField*>(this, Off::UField::Next);
		}
	};
	class UStruct :public UField {
	public:
		int32 get_Size() {
			return memory_helpers::ReadField<int32>(this, Off::UStruct::Size);
		}
		UStruct* get_Super() {
			return memory_helpers::ReadField<UStruct*>(this, Off::UStruct::SuperStruct);
		}
		int16 get_MinAlignment() {
			return memory_helpers::ReadField<int16>(this, Off::UStruct::MinAlignment);
		}
		UField* get_Children() {
			return memory_helpers::ReadField<UField*>(this, Off::UStruct::Children);
		}
		FField* get_ChildProperties() {
			return memory_helpers::ReadField<FField*>(this, Off::UStruct::ChildProperties);
		}
		bool IsSubclassOf(const UStruct* Base) {
			if (!Base)return false;
			for (UStruct* Struct = this; Struct; Struct = Struct->get_Super())
			{
				if (Struct == Base)
					return true;
			}
			return false;
		}
	};
	class UFunction : public UStruct {
	public:
		using FNativeFuncPtr = void (*)(void* Context, void* TheStack, void* Result);
		uint32_t* get_FunctionFlagsAddress() {
			return memory_helpers::GetFieldPointer<uint32_t>(this, Off::UFunction::FunctionFlags);
		}
		FNativeFuncPtr get_ExecFunction() {
			return memory_helpers::ReadField<FNativeFuncPtr>(this, Off::UFunction::ExecFunction);
		}
	};
	class UClass :public UStruct {
	public:
		EClassCastFlags get_CastFlags() {
			return memory_helpers::ReadField<EClassCastFlags>(this, Off::UClass::CastFlags);
		}
		UObject* get_DefaultObject() {
			return memory_helpers::ReadField<UObject*>(this, Off::UClass::ClassDefaultObject);
		}
	public:
		UFunction* GetFunction(const std::wstring& FuncName) {
			for (UField* Field = this->get_Children(); Field; Field = Field->get_Next())
			{
				if (Field->HasTypeFlag(EClassCastFlags::Function) && Field->GetName() == FuncName)
					return static_cast<class UFunction*>(Field);
			}
			return nullptr;

		}
		int32 GetOffset(const std::wstring& PropertyName) {
			for (FProperty* Property = (FProperty*)this->get_ChildProperties(); Property; Property = (FProperty*)Property->get_Next())
			{
				auto Offset = Property->get_Offset();
				if (Offset > 0 && Offset < 0xFFFF && Property->get_Name().c_wstr() == PropertyName) {
					return Offset;
				}
			}
			return NULL;
		}
	};
	//基础结构和类结束

	struct FDFMCommonItemRow
	{
		char    Pad_0[0x10];
		FName	ItemID;
		char    pad_18[0x30];
		int32   GameItemType;
		uint8   Pad_4C[0x4];
		FText   ShortName;// 0x0050(0x0018)
		int32_t Quality;// 0x0068 4
		char    pad_6C[0x6C];
		int32_t InitialGuidePrice;// 0x00D8  4
	};
	struct FInventoryItemInfo
	{
		char pad_00[0x578];
		FDFMCommonItemRow* ItemRow;//0x540
		uint8  Pad_580[0x70];
	};
	struct alignas(0x08) FFastArraySerializer
	{
	public:
		uint8                                         Pad_0[0x54];                                       // 0x0000(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
		int32                                         ArrayReplicationKey;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_58[0xA8];                                      // 0x0058(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
		EFastArraySerializerDeltaFlags                DeltaFlags;                                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
		uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};
	struct FItemArray final : public FFastArraySerializer
	{
	public:
		TArray<struct FInventoryItemInfo>             Items;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
		uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};
	struct FPointDropItem final
	{
	public:
		uint64                                        ItemID;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		FString						                  Description;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        Number;                                            // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        Rarity;                                            // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint64                                        SubItemId;                                         // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        SubItemNumber;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        Weight;                                            // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        Price;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        SellPrice;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint64                                        Gid;                                               // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                          bAIDiedDrop;                                       // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
		uint32                                        MinNumber;                                         // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        MaxNumber;                                         // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        Durability;                                        // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        DurabilityLimit;                                   // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        MinDurability;                                     // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        MaxDurability;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        MinDurabilityLimit;                                // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint32                                        MaxDurabilityLimit;                                // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		uint8                                         Pad_64[0x1C];                                      // 0x0064(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
	};

	class UEngine :public UObject {
		DEFINE_STATIC_CLASS_METHODS(UEngine);
		DEFINE_PROPERTY_GET(UGameViewportClient*, GameViewport);
	};
	class UWorld :public UObject {
		DEFINE_STATIC_CLASS_METHODS(UWorld);
	};

	class UCanvas :public UObject {
		DEFINE_STATIC_CLASS_METHODS(UCanvas);
		DEFINE_PROPERTY_GET(int, SizeX);
		DEFINE_PROPERTY_GET(int, SizeY);
	};
	class UGameViewportClient :public UObject {
		DEFINE_STATIC_CLASS_METHODS(UGameViewportClient);
		DEFINE_PROPERTY_GET(UWorld*, World);
	};

	//地图控制器
	class UBaseUIController :public UObject {
		DEFINE_STATIC_CLASS_METHODS(UBaseUIController);
		DEFINE_PROPERTY_GET(UBaseUIView*, View);
	};
	class UBatchUIController : public UBaseUIController {
		DEFINE_STATIC_CLASS_METHODS(UBatchUIController);
		DEFINE_PROPERTY_GET(TArray<UBaseUIController*>, ChildControllers);


	};
	class UMapBaseHUDController : public UBaseUIController {
